Tekla.Structures.Model.ComponentInput
The ComponentInput class handles the input of component objects and positions. A component has one component input.
The component input must include all the needed input objects and points in the correct order. For example,
an input with a point and a part is different from an input of a part and a point.
The maximum number of different input items in the collection is 10.
The following example creates a component with a given component input:
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam Beam = new Beam(new Point(12000, 0, 0), new Point(12000, 0, 6000));
Beam.Profile.ProfileString = "380*380";
Beam.Material.MaterialString = "K40-1";
Beam.Insert();
Component Component = new Component();
Component.Name = "Component Test";
Component.Number = 30000063;
ComponentInput ComponentInput = new ComponentInput();
ComponentInput.AddInputObject(Beam);
Component.SetComponentInput(ComponentInput);
Component.LoadAttributesFromFile("standard");
Component.SetAttribute("side_bar_space", 333.0);
if (!Component.Insert())
{
Console.WriteLine("Component Insert failed");
}
}
}

Tekla.Structures.Model.ComponentInput._InputObjects
Contains all the Inputs, in the same order as they were entered

Tekla.Structures.Model.ComponentInput.MAX_INPUTITEMS
Max number of input sequences

Tekla.Structures.Model.ComponentInput.#ctor
Creates a new component input object.

Tekla.Structures.Model.ComponentInput.GetInputObjectItemCount
Returns the number of input object sequences.
Returns: The number of input object sequences.

Tekla.Structures.Model.ComponentInput.GetInputObjectItem(System.Int32)
Returns the input object item at the given index.
Index: A zero based index of the input object sequence.
Returns: The input object item.

Tekla.Structures.Model.ComponentInput.AddOneInputPosition(Tekla.Structures.Geometry3d.Point)
Adds an input position to the component input.
P: The position to be added.
Returns: True on success.

Tekla.Structures.Model.ComponentInput.AddTwoInputPositions(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Adds two input positions to the component input.
Position1: The first position to be added.
Position2: The second position to be added.
Returns: True on success.

Tekla.Structures.Model.ComponentInput.AddInputPolygon(Tekla.Structures.Model.Polygon)
Adds a polygon to the component input.
P: The polygon to be added.
Returns: True on success.

Tekla.Structures.Model.ComponentInput.AddInputObject(Tekla.Structures.Model.ModelObject)
Adds a model object to the component input.
M: The model object to be added.
Returns: True on success.

Tekla.Structures.Model.ComponentInput.AddInputObjects(System.Collections.ArrayList)
Adds an array list of  model objects to the component input.
Objects: A list of model objects in the correct order.
Returns: True on success.

Tekla.Structures.Model.ComponentInput.CopyTo(System.Array,System.Int32)
Copies the elements of the  to
an , starting at a particular  index.
array:
The one-dimensional  that is the destination of the elements copied from
the . The  must have zero-based indexing.
index: The zero-based index in the array at which copying begins.
Throws System.ArgumentNullException: The array is null.
Throws System.ArgumentOutOfRangeException: The index is less than zero.
Throws System.ArgumentException:
The array is multidimensional, or the index is equal to or greater than the length of the array, or the number of elements
in the source  is greater than the available space from the index to
the end of the destination array.
Throws System.InvalidCastException:
The type of the source  cannot be cast automatically to the type of
the destination array.
2

Tekla.Structures.Model.ComponentInput.Count
Gets the number of elements contained in the .
2

Tekla.Structures.Model.ComponentInput.IsSynchronized
Gets a value indicating whether access to the  is synchronized (thread safe).
2

Tekla.Structures.Model.ComponentInput.SyncRoot
Gets an object that can be used to synchronize access to the .
2

Tekla.Structures.Model.ComponentInput.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An  object that can be used to iterate through the collection.
2
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
Beam B = new Beam(new Point(12000, 0, 0), new Point(12000, 0, 6000));
B.Profile.ProfileString = "380*380";
B.Material.MaterialString = "K40-1";
if (B.Insert())
{
Component C = new Component();
C.Name = "Component Test";
C.Number = 30000063;
ComponentInput CI = new ComponentInput();
CI.AddInputObject(B);
C.SetComponentInput(CI);
C.LoadAttributesFromFile("standard");
C.SetAttribute("side_bar_space", 333.0);
if (!C.Insert())
{
Console.WriteLine("Component Insert failed");
}
else
{
// test fetching component input
ComponentInput ComponentSel = C.GetComponentInput();
IEnumerator Enumerator = ComponentSel.GetEnumerator();
while (Enumerator.MoveNext())
{
InputItem ObjectInput = Enumerator.Current as InputItem;
if (ObjectInput.GetInputType() == InputItem.InputTypeEnum.INPUT_1_OBJECT)
{
Beam BeamInput = ObjectInput.GetData() as Beam;
}
}
}
}
}
}